DriverTest/Res1/StRes1/Report/Data/Step4.xml

<?xml-stylesheet href="..//StServiceCallActivity.xsl" type="text/xsl"?><report><VTD_Type name="Type">HP.ST.Ext.WebServicesActivities.StServiceCallActivity</VTD_Type><VTD_Name name="Step ID">StServiceCallActivity5</VTD_Name><InputXml name="InputXml" xml="True" link="True" FileLocation="StServiceCallActivity5_InputXml_621c1841-4488-4bd1-97a2-c40d37e7c2cf.xml">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;
  &lt;Body&gt;
    &lt;CreateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;FlightOrder&gt;
        &lt;Class&gt;Business&lt;/Class&gt;
        &lt;CustomerName&gt;Ron S&lt;/CustomerName&gt;
        &lt;DepartureDate&gt;2022-01-01T00:00:00+00:00&lt;/DepartureDate&gt;
        &lt;FlightNumber&gt;10436&lt;/FlightNumber&gt;
        &lt;NumberOfTickets&gt;2&lt;/NumberOfTickets&gt;
      &lt;/FlightOrder&gt;
    &lt;/CreateFlightOrder&gt;
  &lt;/Body&gt;
&lt;/Envelope&gt;</InputXml><Service name="Service">Flights_Service</Service><Port name="Port">FlightsServiceMethods</Port><Operation name="Operation">CreateFlightOrder</Operation><Address name="Address">http://localhost:8000/Flights_SOAP</Address><SOAPAction name="SOAPAction">HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder</SOAPAction><ContentType name="ContentType">text/xml; charset=utf-8</ContentType><MessageExchangePattern name="MessageExchangePattern">Request Response</MessageExchangePattern><Full_request name="Full request" TooLong="True" link="True" FileLocation="StServiceCallActivity5_Full_request_995cdee3-59ef-440f-a941-158132937bd3.xml">&lt;?xml version="1.0"? ... &lt;/Body&gt;
&lt;/Envelope&gt;</Full_request><InputHeader name="InputHeader">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder
Content-Type:	text/xml; charset=utf-8
Host:	localhost:8000
Content-Length:	412
Connection:	Close
</InputHeader><OutputHeader name="OutputHeader">Connection:	close
Content-Length:	337
Content-Type:	text/xml; charset=utf-8
Date:	Fri, 11 Jun 2021 16:14:07 GMT
Server:	Microsoft-HTTPAPI/2.0
</OutputHeader><OutputText name="OutputText">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;OrderNumber&gt;91&lt;/OrderNumber&gt;&lt;TotalPrice&gt;687.2&lt;/TotalPrice&gt;&lt;/CreateFlightOrderResult&gt;&lt;/CreateFlightOrderResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</OutputText><HttpStatusCode name="HttpStatusCode">200 : OK</HttpStatusCode><OutputXml name="OutputXml" xml="True" link="True" FileLocation="StServiceCallActivity5_OutputXml_6e78709f-c05f-492c-8a27-7559fe8c5098.xml">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;OrderNumber&gt;91&lt;/OrderNumber&gt;
        &lt;TotalPrice&gt;687.2&lt;/TotalPrice&gt;
      &lt;/CreateFlightOrderResult&gt;
    &lt;/CreateFlightOrderResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</OutputXml><VTD_Message name="Message">Web service call performed successfully</VTD_Message><Name name="Name">'CreateFlightOrder'</Name><Comment name="Comment">''</Comment><VTD_Status name="Status">Done</VTD_Status></report>